-- users 테이블 목업 데이터
INSERT INTO users (username, password, role)
VALUES ('admin', '$2a$10$tMqCuWQ7N4MeY348URpJe.ysEOAWPqcMZDEIgKBrA8cQSTMnusDEC', 'ADMIN');

-- post 테이블 목업 데이터
INSERT INTO post (contents, create_by, created_at, delete_yn, title, updated_at, updated_by)
VALUES
('첫 번째 게시글 내용입니다.', 'admin', '2025-12-04 10:00:00', 'N', '첫 번째 글', '2025-12-04 10:00:00', 'admin'),
('두 번째 게시글 내용입니다.', 'admin', '2025-12-04 11:00:00', 'N', '두 번째 글', '2025-12-04 11:00:00', 'admin'),
('세 번째 게시글 내용입니다.', 'admin', '2025-12-04 10:00:00', 'N', '세 번째 글', '2025-12-04 10:00:00', 'admin'),
('네 번째 게시글 내용입니다.', 'admin', '2025-12-04 11:00:00', 'N', '네 번째 글', '2025-12-04 11:00:00', 'admin'),
('다섯 번째 게시글 내용입니다.', 'admin', '2025-12-04 10:00:00', 'N', '다섯 번째 글', '2025-12-04 10:00:00', 'admin'),
('여섯 번째 게시글 내용입니다.', 'admin', '2025-12-04 11:00:00', 'N', '여섯 번째 글', '2025-12-04 11:00:00', 'admin'),
('일곱 번째 게시글 내용입니다.', 'admin', '2025-12-04 10:00:00', 'N', '일곱 번째 글', '2025-12-04 10:00:00', 'admin'),
('여덟 번째 게시글 내용입니다.', 'admin', '2025-12-04 11:00:00', 'N', '여덟 번째 글', '2025-12-04 11:00:00', 'admin'),
('아홉 번째 게시글 내용입니다.', 'admin', '2025-12-04 10:00:00', 'N', '아홉 번째 글', '2025-12-04 10:00:00', 'admin'),
('열 번째 게시글 내용입니다.', 'admin', '2025-12-04 11:00:00', 'N', '열 번째 글', '2025-12-04 11:00:00', 'admin'),
('열한 번째 게시글 내용입니다.', 'admin', '2025-12-04 12:00:00', 'N', '열한 번째 글', '2025-12-04 12:00:00', 'admin');

INSERT INTO comment (content, author, post_id, created_at, updated_at, delete_yn)
VALUES
('첫 번째 게시글에 대한 첫 번째 댓글입니다.', 'admin', 1, '2025-12-04 10:30:00', '2025-12-04 10:30:00', 'N'),
('첫 번째 게시글에 대한 두 번째 댓글입니다.', 'admin', 1, '2025-12-04 10:45:00', '2025-12-04 10:45:00', 'N'),
('두 번째 게시글에 대한 첫 번째 댓글입니다.', 'admin', 2, '2025-12-04 11:15:00', '2025-12-04 11:15:00', 'N'),
('세 번째 게시글에 대한 첫 번째 댓글입니다.', 'admin', 3, '2025-12-04 12:30:00', '2025-12-04 12:30:00', 'N'),
('세 번째 게시글에 대한 두 번째 댓글입니다.', 'admin', 3, '2025-12-04 12:45:00', '2025-12-04 12:45:00', 'N');